cnlohr/ch32v003fun/ch32v203fun/ch32v203fun.h
	__ASM volatile ( "csrr %0," "misa" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MISA
 *
 * @brief   Set the Machine ISA Register
 *
 * @param   value  - set misa value
 *
 * @return  none
 */
static inline void __set_MISA(uint32_t value)
{
	__ASM volatile ("csrw misa, %0" : : "r" (value) );
}


/*********************************************************************
 * @fn      __get_MTVEC
 *
 * @brief   Return the Machine Trap-Vector Base-Address Register
 *
 * @return  mtvec value
 */
static inline uint32_t __get_MTVEC(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mtvec" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MTVEC
 *
 * @brief   Set the Machine Trap-Vector Base-Address Register
 *
 * @param   value  - set mtvec value
 *
 * @return  none
 */
static inline void __set_MTVEC(uint32_t value)
{
	__ASM volatile ("csrw mtvec, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_MSCRATCH
 *
 * @brief   Return the Machine Seratch Register
 *
 * @return  mscratch value
 */
static inline uint32_t __get_MSCRATCH(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mscratch" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MSCRATCH
 *
 * @brief   Set the Machine Seratch Register
 *
 * @param   value  - set mscratch value
 *
 * @return  none
 */
static inline void __set_MSCRATCH(uint32_t value)
{
	__ASM volatile ("csrw mscratch, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_MEPC
 *
 * @brief   Return the Machine Exception Program Register
 *
 * @return  mepc value
 */
static inline uint32_t __get_MEPC(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mepc" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MEPC
 *
 * @brief   Set the Machine Exception Program Register
 *
 * @return  mepc value
 */
static inline void __set_MEPC(uint32_t value)
{
	__ASM volatile ("csrw mepc, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_MCAUSE
 *
 * @brief   Return the Machine Cause Register
 *
 * @return  mcause value
 */
static inline uint32_t __get_MCAUSE(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mcause" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MEPC
 *
 * @brief   Set the Machine Cause Register
 *
 * @return  mcause value
 */
static inline void __set_MCAUSE(uint32_t value)
{
	__ASM volatile ("csrw mcause, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_MTVAL
 *
 * @brief   Return the Machine Trap Value Register
 *
 * @return  mtval value
 */
static inline uint32_t __get_MTVAL(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mtval" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __set_MTVAL
 *
 * @brief   Set the Machine Trap Value Register
 *
 * @return  mtval value
 */
static inline void __set_MTVAL(uint32_t value)
{
	__ASM volatile ("csrw mtval, %0" : : "r" (value) );
}

/*********************************************************************
 * @fn      __get_MVENDORID
 *
 * @brief   Return Vendor ID Register
 *
 * @return  mvendorid value
 */
static inline uint32_t __get_MVENDORID(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mvendorid" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __get_MARCHID
 *
 * @brief   Return Machine Architecture ID Register
 *
 * @return  marchid value
 */
static inline uint32_t __get_MARCHID(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "marchid" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __get_MIMPID
 *
 * @brief   Return Machine Implementation ID Register
 *
 * @return  mimpid value
 */
static inline uint32_t __get_MIMPID(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mimpid" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __get_MHARTID
 *
 * @brief   Return Hart ID Register
 *
 * @return  mhartid value
 */
static inline uint32_t __get_MHARTID(void)
{
	uint32_t result;

	__ASM volatile ( "csrr %0," "mhartid" : "=r" (result) );
	return (result);
}

/*********************************************************************
 * @fn      __get_SP
 *
 * @brief   Return SP Register
 *
 * @return  SP value
 */
static inline uint32_t __get_SP(void)
{
	uint32_t result;

	__ASM volatile ( "mv %0," "sp" : "=r"(result) : );
	return (result);
}

#endif

#ifdef __cplusplus
}
#endif

#endif/* __CORE_RISCV_H__ */


///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////

#ifdef __cplusplus
extern "C" {
#endif

#ifdef SYSTICK_USE_HCLK
#define DELAY_US_TIME ((SYSTEM_CORE_CLOCK)/1000000)
#define DELAY_MS_TIME ((SYSTEM_CORE_CLOCK)/1000)
#define SETUP_SYSTICK_HCLK SysTick->CTLR = 5;
#else // Use systick = hclk/8
#define DELAY_US_TIME ((SYSTEM_CORE_CLOCK)/8000000)
#define DELAY_MS_TIME ((SYSTEM_CORE_CLOCK)/8000)
#define SETUP_SYSTICK_HCLK SysTick->CTLR = 1;
#endif

#if defined(__riscv) || defined(__riscv__) || defined( CH32V203FUN_BASE )

// Stuff that can only be compiled on device (not for the programmer, or other host programs)

#ifndef ASSEMBLER
void handle_reset()            __attribute__((naked)) __attribute((section(".text.handle_reset"))) __attribute__((used));
void DefaultIRQHandler( void ) __attribute__((section(".text.vector_handler"))) __attribute__((naked)) __attribute__((used));
#endif

#endif

#define Delay_Us(n) DelaySysTick( (n) * DELAY_US_TIME )
#define Delay_Ms(n) DelaySysTick( (n) * DELAY_MS_TIME )

#ifndef __ASSEMBLER__

void DelaySysTick( uint32_t n );

// Tricky: We need to make sure main and SystemInit() are preserved.
int main() __attribute__((used));
void SystemInit(void) __attribute__((used));

// Initialization functions
void SystemInit144HSI( void );
void SystemInit144HSE( void );

// TODO: Debug and UART

// Just a definition to the internal _write function.
int _write(int fd, const char *buf, int size);

#endif

#ifdef __cplusplus
};
#endif